---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.SelectionFailures
source: html/0ca5e8cd-e726-6b89-e08f-c6b372e2f147.htm
---
# BuiltInFailures.SelectionFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.